espressif/esp-idf/components/soc/esp32c5/register/soc/i2s_reg.h
/** I2S_RX_RECOMB_CTRL_REG register
 *  I2S RX configure register 1
 */
#define I2S_RX_RECOMB_CTRL_REG(i) (REG_I2S_BASE(i) + 0x30)
/** I2S_RX_RECOMB_EN : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable i2s rx data recombination.
 */
#define I2S_RX_RECOMB_EN    (BIT(0))
#define I2S_RX_RECOMB_EN_M  (I2S_RX_RECOMB_EN_V << I2S_RX_RECOMB_EN_S)
#define I2S_RX_RECOMB_EN_V  0x00000001U
#define I2S_RX_RECOMB_EN_S  0
/** I2S_RX_RECOMB_EXT_CH_NUM : R/W; bitpos: [2:1]; default: 0;
 *  The channel number that i2s will extract the data into.
 */
#define I2S_RX_RECOMB_EXT_CH_NUM    0x00000003U
#define I2S_RX_RECOMB_EXT_CH_NUM_M  (I2S_RX_RECOMB_EXT_CH_NUM_V << I2S_RX_RECOMB_EXT_CH_NUM_S)
#define I2S_RX_RECOMB_EXT_CH_NUM_V  0x00000003U
#define I2S_RX_RECOMB_EXT_CH_NUM_S  1
/** I2S_RX_RECOMB_UPDATE : WT; bitpos: [31]; default: 0;
 *  Set this bit to update i2s data recombination configuration, must be performed
 *  after changing the config of any recombined-dma-channel.
 */
#define I2S_RX_RECOMB_UPDATE    (BIT(31))
#define I2S_RX_RECOMB_UPDATE_M  (I2S_RX_RECOMB_UPDATE_V << I2S_RX_RECOMB_UPDATE_S)
#define I2S_RX_RECOMB_UPDATE_V  0x00000001U
#define I2S_RX_RECOMB_UPDATE_S  31

/** I2S_RX_RECOMB_DMA_CH0_REG register
 *  I2S RX recombined-dma-channel configuration register
 */
#define I2S_RX_RECOMB_DMA_CH0_REG(i) (REG_I2S_BASE(i) + 0x34)
/** I2S_RX_RECOMB_DMA_CH0_VALID : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable the adc-dma-channel.
 */
#define I2S_RX_RECOMB_DMA_CH0_VALID    (BIT(0))
#define I2S_RX_RECOMB_DMA_CH0_VALID_M  (I2S_RX_RECOMB_DMA_CH0_VALID_V << I2S_RX_RECOMB_DMA_CH0_VALID_S)
#define I2S_RX_RECOMB_DMA_CH0_VALID_V  0x00000001U
#define I2S_RX_RECOMB_DMA_CH0_VALID_S  0
/** I2S_RX_RECOMB_DMA_CH0_STYLE : R/W; bitpos: [4:1]; default: 0;
 *  Set this field to set the recombined-dma-channel style. If choose to use i2s
 *  extracted ch 1&3 in 4 channels, the style should be: 6'b1010.
 */
#define I2S_RX_RECOMB_DMA_CH0_STYLE    0x0000000FU
#define I2S_RX_RECOMB_DMA_CH0_STYLE_M  (I2S_RX_RECOMB_DMA_CH0_STYLE_V << I2S_RX_RECOMB_DMA_CH0_STYLE_S)
#define I2S_RX_RECOMB_DMA_CH0_STYLE_V  0x0000000FU
#define I2S_RX_RECOMB_DMA_CH0_STYLE_S  1
/** I2S_RX_RECOMB_DMA_CH0_ORDER : R/W; bitpos: [12:5]; default: 0;
 *  Set this field to set the recombined-dma-channel order. If choose to use the order
 *  ch3 -> ch1, the order should be: 8'd7 = {2'd0,2'd0,2'd1,2'd3}.
 */
#define I2S_RX_RECOMB_DMA_CH0_ORDER    0x000000FFU
#define I2S_RX_RECOMB_DMA_CH0_ORDER_M  (I2S_RX_RECOMB_DMA_CH0_ORDER_V << I2S_RX_RECOMB_DMA_CH0_ORDER_S)
#define I2S_RX_RECOMB_DMA_CH0_ORDER_V  0x000000FFU
#define I2S_RX_RECOMB_DMA_CH0_ORDER_S  5
/** I2S_RX_RECOMB_DMA_CH0_EOF_NUM : R/W; bitpos: [28:13]; default: 0;
 *  Set this field to set the receive eof byte length of the recombined-dma-channel.
 */
#define I2S_RX_RECOMB_DMA_CH0_EOF_NUM    0x0000FFFFU
#define I2S_RX_RECOMB_DMA_CH0_EOF_NUM_M  (I2S_RX_RECOMB_DMA_CH0_EOF_NUM_V << I2S_RX_RECOMB_DMA_CH0_EOF_NUM_S)
#define I2S_RX_RECOMB_DMA_CH0_EOF_NUM_V  0x0000FFFFU
#define I2S_RX_RECOMB_DMA_CH0_EOF_NUM_S  13

/** I2S_RX_RECOMB_DMA_CH1_REG register
 *  I2S RX recombined-dma-channel configuration register
 */
#define I2S_RX_RECOMB_DMA_CH1_REG(i) (REG_I2S_BASE(i) + 0x38)
/** I2S_RX_RECOMB_DMA_CH1_VALID : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable the adc-dma-channel.
 */
#define I2S_RX_RECOMB_DMA_CH1_VALID    (BIT(0))
#define I2S_RX_RECOMB_DMA_CH1_VALID_M  (I2S_RX_RECOMB_DMA_CH1_VALID_V << I2S_RX_RECOMB_DMA_CH1_VALID_S)
#define I2S_RX_RECOMB_DMA_CH1_VALID_V  0x00000001U
#define I2S_RX_RECOMB_DMA_CH1_VALID_S  0
/** I2S_RX_RECOMB_DMA_CH1_STYLE : R/W; bitpos: [4:1]; default: 0;
 *  Set this field to set the recombined-dma-channel style. If choose to use i2s
 *  extracted ch 1&3 in 4 channels, the style should be: 6'b1010.
 */
#define I2S_RX_RECOMB_DMA_CH1_STYLE    0x0000000FU
#define I2S_RX_RECOMB_DMA_CH1_STYLE_M  (I2S_RX_RECOMB_DMA_CH1_STYLE_V << I2S_RX_RECOMB_DMA_CH1_STYLE_S)
#define I2S_RX_RECOMB_DMA_CH1_STYLE_V  0x0000000FU
#define I2S_RX_RECOMB_DMA_CH1_STYLE_S  1
/** I2S_RX_RECOMB_DMA_CH1_ORDER : R/W; bitpos: [12:5]; default: 0;
 *  Set this field to set the recombined-dma-channel order. If choose to use the order
 *  ch3 -> ch1, the order should be: 8'd7 = {2'd0,2'd0,2'd1,2'd3}.
 */
#define I2S_RX_RECOMB_DMA_CH1_ORDER    0x000000FFU
#define I2S_RX_RECOMB_DMA_CH1_ORDER_M  (I2S_RX_RECOMB_DMA_CH1_ORDER_V << I2S_RX_RECOMB_DMA_CH1_ORDER_S)
#define I2S_RX_RECOMB_DMA_CH1_ORDER_V  0x000000FFU
#define I2S_RX_RECOMB_DMA_CH1_ORDER_S  5
/** I2S_RX_RECOMB_DMA_CH1_EOF_NUM : R/W; bitpos: [28:13]; default: 0;
 *  Set this field to set the receive eof byte length of the recombined-dma-channel.
 */
#define I2S_RX_RECOMB_DMA_CH1_EOF_NUM    0x0000FFFFU
#define I2S_RX_RECOMB_DMA_CH1_EOF_NUM_M  (I2S_RX_RECOMB_DMA_CH1_EOF_NUM_V << I2S_RX_RECOMB_DMA_CH1_EOF_NUM_S)
#define I2S_RX_RECOMB_DMA_CH1_EOF_NUM_V  0x0000FFFFU
#define I2S_RX_RECOMB_DMA_CH1_EOF_NUM_S  13

/** I2S_RX_RECOMB_DMA_CH2_REG register
 *  I2S RX recombined-dma-channel configuration register
 */
#define I2S_RX_RECOMB_DMA_CH2_REG(i) (REG_I2S_BASE(i) + 0x3c)
/** I2S_RX_RECOMB_DMA_CH2_VALID : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable the adc-dma-channel.
 */
#define I2S_RX_RECOMB_DMA_CH2_VALID    (BIT(0))
#define I2S_RX_RECOMB_DMA_CH2_VALID_M  (I2S_RX_RECOMB_DMA_CH2_VALID_V << I2S_RX_RECOMB_DMA_CH2_VALID_S)
#define I2S_RX_RECOMB_DMA_CH2_VALID_V  0x00000001U
#define I2S_RX_RECOMB_DMA_CH2_VALID_S  0
/** I2S_RX_RECOMB_DMA_CH2_STYLE : R/W; bitpos: [4:1]; default: 0;
 *  Set this field to set the recombined-dma-channel style. If choose to use i2s
 *  extracted ch 1&3 in 4 channels, the style should be: 6'b1010.
 */
#define I2S_RX_RECOMB_DMA_CH2_STYLE    0x0000000FU
#define I2S_RX_RECOMB_DMA_CH2_STYLE_M  (I2S_RX_RECOMB_DMA_CH2_STYLE_V << I2S_RX_RECOMB_DMA_CH2_STYLE_S)
#define I2S_RX_RECOMB_DMA_CH2_STYLE_V  0x0000000FU
#define I2S_RX_RECOMB_DMA_CH2_STYLE_S  1
/** I2S_RX_RECOMB_DMA_CH2_ORDER : R/W; bitpos: [12:5]; default: 0;
 *  Set this field to set the recombined-dma-channel order. If choose to use the order
 *  ch3 -> ch1, the order should be: 8'd7 = {2'd0,2'd0,2'd1,2'd3}.
 */
#define I2S_RX_RECOMB_DMA_CH2_ORDER    0x000000FFU
#define I2S_RX_RECOMB_DMA_CH2_ORDER_M  (I2S_RX_RECOMB_DMA_CH2_ORDER_V << I2S_RX_RECOMB_DMA_CH2_ORDER_S)
#define I2S_RX_RECOMB_DMA_CH2_ORDER_V  0x000000FFU
#define I2S_RX_RECOMB_DMA_CH2_ORDER_S  5
/** I2S_RX_RECOMB_DMA_CH2_EOF_NUM : R/W; bitpos: [28:13]; default: 0;
 *  Set this field to set the receive eof byte length of the recombined-dma-channel.
 */
#define I2S_RX_RECOMB_DMA_CH2_EOF_NUM    0x0000FFFFU
#define I2S_RX_RECOMB_DMA_CH2_EOF_NUM_M  (I2S_RX_RECOMB_DMA_CH2_EOF_NUM_V << I2S_RX_RECOMB_DMA_CH2_EOF_NUM_S)
#define I2S_RX_RECOMB_DMA_CH2_EOF_NUM_V  0x0000FFFFU
#define I2S_RX_RECOMB_DMA_CH2_EOF_NUM_S  13

